meliksahaltuntas/NucleoWB55/Projects/NUCLEO_BLE_TEST/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_p2pServer/STM32_WPAN/App/app_ble.c
  if ((NewStatus == APP_BLE_LP_ADV)
      && ((BleApplicationContext.Device_Connection_Status == APP_BLE_FAST_ADV)
          || (BleApplicationContext.Device_Connection_Status == APP_BLE_LP_ADV)))
  {
    /* Connection in ADVERTISE mode have to stop the current advertising */
    ret = aci_gap_set_non_discoverable();
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_set_non_discoverable - Stop Advertising Failed , result: %d \n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_set_non_discoverable - Successfully Stopped Advertising \n");
    }
  }

  BleApplicationContext.Device_Connection_Status = NewStatus;
  /* Start Fast or Low Power Advertising */
  ret = aci_gap_set_discoverable(ADV_IND,
                                   Min_Inter,
                                   Max_Inter,
                                   CFG_BLE_ADDRESS_TYPE,
                                   NO_WHITE_LIST_USE, /* use white list */
                                   strlen(current_device_name),    // Use device name length
                                   (uint8_t*)current_device_name,  // Use device name
                                   BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen,
                                   BleApplicationContext.BleApplicationContext_legacy.advtServUUID,
                                   0,
                                   0);

    // Set scan response after making discoverable
    if (scan_response_length > 0) {
        hci_le_set_scan_response_data(scan_response_length, scan_response_data);
    }
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> aci_gap_set_discoverable - fail, result: 0x%x \n", ret);
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_set_discoverable - Success\n");
  }

  /* Update Advertising data */
  ret = aci_gap_update_adv_data(sizeof(a_ManufData), (uint8_t*) a_ManufData);
  if (ret != BLE_STATUS_SUCCESS)
  {
    if (NewStatus == APP_BLE_FAST_ADV)
    {
      APP_DBG_MSG("==>> Start Fast Advertising Failed , result: %d \n\r", ret);
    }
    else
    {
      APP_DBG_MSG("==>> Start Low Power Advertising Failed , result: %d \n\r", ret);
    }
  }
  else
  {
    if (NewStatus == APP_BLE_FAST_ADV)
    {
      APP_DBG_MSG("==>> Success: Start Fast Advertising \n\r");
      /* Start Timer to STOP ADV - TIMEOUT - and next Restart Low Power Advertising */
      HW_TS_Start(BleApplicationContext.Advertising_mgr_timer_Id, INITIAL_ADV_TIMEOUT);
    }
    else
    {
      APP_DBG_MSG("==>> Success: Start Low Power Advertising \n\r");
    }
  }

  return;
}

const uint8_t* BleGetBdAddress(void)
{
  uint8_t *p_otp_addr;
  const uint8_t *p_bd_addr;
  uint32_t udn;
  uint32_t company_id;
  uint32_t device_id;

  udn = LL_FLASH_GetUDN();

  if (udn != 0xFFFFFFFF)
  {
    company_id = LL_FLASH_GetSTCompanyID();
    device_id = LL_FLASH_GetDeviceID();

    /**
     * Public Address with the ST company ID
     * bit[47:24] : 24bits (OUI) equal to the company ID
     * bit[23:16] : Device ID.
     * bit[15:0] : The last 16bits from the UDN
     * Note: In order to use the Public Address in a final product, a dedicated
     * 24bits company ID (OUI) shall be bought.
     */
    a_BdAddrUdn[0] = (uint8_t)(udn & 0x000000FF);
    a_BdAddrUdn[1] = (uint8_t)((udn & 0x0000FF00) >> 8);
    a_BdAddrUdn[2] = (uint8_t)device_id;
    a_BdAddrUdn[3] = (uint8_t)(company_id & 0x000000FF);
    a_BdAddrUdn[4] = (uint8_t)((company_id & 0x0000FF00) >> 8);
    a_BdAddrUdn[5] = (uint8_t)((company_id & 0x00FF0000) >> 16);

    p_bd_addr = (const uint8_t *)a_BdAddrUdn;
  }
  else
  {
    p_otp_addr = OTP_Read(0);
    if (p_otp_addr)
    {
      p_bd_addr = ((OTP_ID0_t*)p_otp_addr)->bd_address;
    }
    else
    {
      p_bd_addr = a_MBdAddr;
    }
  }

  return p_bd_addr;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */
static void Update_Device_Name_With_Counter(void)
{
    tBleStatus ret;
    static uint16_t current_name_counter;

    // Random sayı üret
    uint32_t random_val;
    HAL_RNG_GenerateRandomNumber(&hrng, &random_val);
    current_name_counter = random_val % 10000;

    // Yeni isim oluştur
    snprintf(current_device_name, sizeof(current_device_name), "%s%04d", base_name, current_name_counter);

    APP_DBG_MSG("=== SERVER YENI ISIM ===\n");
    APP_DBG_MSG("Yeni server ismi: %s\n", current_device_name);

    // Scan response hazırla
    uint8_t name_len = strlen(current_device_name);
    scan_response_length = name_len + 2;

    if (scan_response_length <= 31) {
        scan_response_data[0] = name_len + 1;
        scan_response_data[1] = AD_TYPE_COMPLETE_LOCAL_NAME;
        memcpy(&scan_response_data[2], current_device_name, name_len);

        ret = hci_le_set_scan_response_data(scan_response_length, scan_response_data);
        if (ret == BLE_STATUS_SUCCESS) {
            APP_DBG_MSG("✓ Isim scan response'a yazıldı\n");
        }
    }
}
static void Reset_System_Timeout(void)
{
    APP_DBG_MSG("=== SERVER: TIMEOUT OR TRANSFER COMPLETE ===\n");
    UTIL_SEQ_SetTask(1 << CFG_TASK_SYSTEM_RESET_ID, CFG_SCH_PRIO_0);
}

static void Process_System_Reset(void)
{
    APP_DBG_MSG("=== SERVER: PERFORMING SYSTEM RESET ===\n");
    APP_DBG_MSG("Generating new identity and restarting...\n");

    // Tüm timer'ları durdur
    HW_TS_Stop(Reset_timer_Id);
    HW_TS_Stop(BleApplicationContext.Advertising_mgr_timer_Id);

    // Advertising'i durdur
    aci_gap_set_non_discoverable();

    // Bağlantı varsa kes
    if (BleApplicationContext.BleApplicationContext_legacy.connectionHandle != 0xFFFF) {
        aci_gap_terminate(BleApplicationContext.BleApplicationContext_legacy.connectionHandle, 0x13);
    }

    // Kısa bekleme
    HAL_Delay(100);

    // Sistem reset
    APP_DBG_MSG("System reset in 3...2...1...\n");
    HAL_Delay(1000);
    NVIC_SystemReset();
}
/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 * SPECIFIC FUNCTIONS FOR P2P SERVER
 *
 *************************************************************/
static void Adv_Cancel(void)
{
  /* USER CODE BEGIN Adv_Cancel_1 */
  BSP_LED_Off(LED_GREEN);
  /* USER CODE END Adv_Cancel_1 */

  /* USER CODE BEGIN Adv_Cancel_2 */

  /* USER CODE END Adv_Cancel_2 */

  return;
}

